trade_exp/src/Documents/УстановкаНормРабочегоВремени/УстановкаНормРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8e8e3a99-4197-4280-a1f3-12402d9c85fa">
  <name>УстановкаНормРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="678a368a-6569-4249-a67b-9d9d52a7c1a7">
    <name>ПериодРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7c7a1f9a-8902-4a61-9596-ae0346c08881">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ca42623-3edd-4fc3-9f1d-669c3057875e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="339dae12-eda4-411a-94b9-a14457544bbc">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ffb191e-1568-448f-bc7e-e5a6b0ba4c83">
    <name>НормаЧасовВМесяцНаСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d293afe-ebfd-47af-81aa-77c4c6bf16c6">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08796fea-c01e-438f-a2e7-9c40e5ac3b87">
    <name>КоличествоЧеловекВОтделе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="3a3d5c47-777c-483a-9aa4-30bd20af3ab9">
    <name>НормыВремени</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e0bf11f9-fc55-4b3e-8ef1-538fd56c8bcb">
      <name>ДеньНедели</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9953016e-1b61-4528-b677-a7549a34f908">
      <name>ДеньНеделиСтрокой</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>11</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a22a012e-7c74-479f-808a-fc0d70b5f334">
      <name>ЧасыРаботыОрганизацииВДень</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a2edfb04-3d3f-497e-b85e-ff548fa14cb9">
      <name>КоличествоЧеловек</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fb8e5cb7-6c46-4091-8726-9b519017d6b0">
      <name>НормаЧасовРаботыНаЧеловекаВДень</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/НормыРабочегоВремени/НормыРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="413602ea-80a3-4725-aa64-5228c99ad381">
  <name>НормыРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="7cf78c8a-4996-4290-aca0-fd371b349f11">
    <name>НормаЧасовРаботыНаЧеловекаВДень</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="c5d0dfed-eb21-44e7-849f-98db3797221c">
    <name>ДеньНеделиСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="b54f398b-8f04-496e-afe2-a46a44415412">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1304451b-5d05-4e61-ac2b-0511f05cf688">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fc7c6fd6-e10b-4a20-8f94-c93c52f244e7">
    <name>ДеньНедели</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/УстановкаНормРабочегоВремени/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр НормыРабочегоВремени
	Движения.НормыРабочегоВремени.Записывать = Истина;
	Для Каждого ТекСтрокаНормыВремени Из НормыВремени Цикл
		Движение = Движения.НормыРабочегоВремени.Добавить();
		Движение.Период = Дата;
		Движение.Отдел = Отдел;
		Движение.ГрафикРаботы = ГрафикРаботы;
		Движение.ДеньНедели = ТекСтрокаНормыВремени.ДеньНедели;
		Движение.НормаЧасовРаботыНаЧеловекаВДень = ТекСтрокаНормыВремени.НормаЧасовРаботыНаЧеловекаВДень;
		Движение.ДеньНеделиСтрокой = ТекСтрокаНормыВремени.ДеньНеделиСтрокой;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НормыВремени.Количество() <> 7 Тогда
		Сообщить("В таблице норм должны быть заполнены все семь дней недели!");
		Отказ= Истина;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
